# 20200813
# 深浅copy

# 1、浅copy:是把原列表第一层的内存地址不加区分的copy一份给新列表

# lst1 = ['Bruce', 'Alex', [111, 222]]
# lst3 = lst1.copy()

# print(lst1)
# print(lst3)
#运行结果
'''
['Bruce', 'Alex', [111, 222]]
['Bruce', 'Alex', [111, 222]]
'''

# print(id(lst1))
# print(id(lst3))
# 运行结果
'''
2059838805056
2059838618880
'''

# print(id(lst1[0]), id(lst1[1]), id(lst1[2]))
# print(id(lst3[0]), id(lst3[1]), id(lst3[2]))
# 对应的id值
'''
    不可变         不可变         可变
1414995312112 1414996621104 1414998054656
1414995312112 1414996621104 1414998054656
'''

# print(id(lst1[2][0]),id(lst1[2][1]))
# print(id(lst3[2][0]),id(lst3[2][1]))
# 可变类型中的不可变类型的值对应的id值
'''
140712907514976 140712907518528
140712907514976 140712907518528
'''

# 修改lst1中的值，观察lst3中值的变化
# lst1[0]='BRUCE'
# lst1[1]='ALEX'
# lst1[2][0]='aaa'
# lst1[2][1]='bbb'
# print(lst1)
# print(lst3)
# 运行结果
'''
lst1=['BRUCE', 'ALEX', ['aaa', 'bbb']]
lst3=['Bruce', 'Alex', ['aaa', 'bbb']]
'''
# 得出的结论：浅copy中，改变lst1中的不可变类型与可变类型，
#           则lst3中不改变对应的不可变类型的值，而改变了对应的可变类型的值

# print(id(lst1[0]), id(lst1[1]), id(lst1[2]))
# print(id(lst3[0]), id(lst3[1]), id(lst3[2]))
# 改变对应的lst1中的值后对应的的id值
'''
    不可变         不可变         可变
1414996620784 1414996621680 1414998054656
1414995312112 1414996621104 1414998054656
'''

# print(id(lst1[2][0]),id(lst1[2][1]))
# print(id(lst3[2][0]),id(lst3[2][1]))
# 浅copy中，改变lst1中的可变类型中对应的不可变类型，可变类型中的不可变类型的值对应的id值
'''
2267543436016 2267545929712
2267543436016 2267545929712
'''

# 2、深copy：针对的是改操作

# import copy
# lst1 = ['Bruce', 'Alex', [111, 222]]
# lst3=copy.deepcopy(lst1)

# print(lst1)
# print(lst3)
#运行结果
'''
['Bruce', 'Alex', [111, 222]]
['Bruce', 'Alex', [111, 222]]
'''

# print(id(lst1))
# print(id(lst3))
#运行结果
'''
1505948776320
1505948849280
'''

# print(id(lst1[0]),id(lst1[1]),id(lst1[2]))
# print(id(lst3[0]),id(lst3[1]),id(lst3[2]))
# 运行结果
'''
针对不可变类型与可变类型深copy后对应的地址
    不可变         不可变          可变
2410020208112 2410021517104 2410022950144
2410020208112 2410021517104 2410022909568
'''

# print(id(lst1[2][0]),id(lst1[2][1]))
# print(id(lst3[2][0]),id(lst3[2][1]))
# 运行结果
'''
可变类型list中的两个元素地址在深copy后，与原来的地址一样
140712826119264 140712826122816
140712826119264 140712826122816
'''

# 修改lst中的值，对比深copy后的结果
# lst1[0]='BRUCE'
# lst1[1]='ALEX'
# lst1[2][0]='aaa'
# lst1[2][1]='bbb'

# print(lst1)
# print(lst3)
# 运行结果
'''
lst1=['BRUCE', 'ALEX', ['aaa', 'bbb']]
lst3=['Bruce', 'Alex', [111, 222]]
'''

# print(id(lst1[0]),id(lst1[1]),id(lst1[2]))
# print(id(lst3[0]),id(lst3[1]),id(lst3[2]))
# 运行结果
'''
id(lst1[])=3113786409648 3113816885232 3113816871744
id(lst3[])=3113785818608 3113786409840 3113816835328
'''

# print(id(lst1[2][0]),id(lst1[2][1]))
# print(id(lst3[2][0]),id(lst3[2][1]))
# 运行结果
'''
id(lst1[2][])=2241576764784 2241576792432
id(lst3[2][])140712826119264 140712826122816
'''